{
  "goku": [
    "Well, if your friend is stronger than you, I guess you're the third strongest Saiyan now.",
    "I'm the Saiyan who came all the way from Earth for the sole purpose of beating you. I am the warrior you've heard of in the legends, pure of heart and awakened by fury - that's what I am.",
    "I am the hope of the universe....I am the answer to all living things that cry out for peace...I am the protector of the innocent...I am the light in the darkness...I am truth. Ally to good... Nightmare to you!!!",
    "I'm sorry that took so much longer than the others, but I haven't had much occasion to practice this one. This is what I call a Super Saiyan 3.",
    "Why'd I have to get this guy? Sure, he's big, but he kinda looks dumb to me.",
    "You seem to delight in seeing other people suffer. And you treat life like a disposable commodity! You destroy homes. You take the lives of innocent, peace-loving people. You even take the lives of children. And all of this for your own amusement of personal gain! Well, now, it's your turn!",
    "That's enough! Even if it is true and I'm some kind of alien from another planet, or even if you really are my older brother, it doesn't matter, anyone who'd do the horrible things you say is no brother of mine! My name is Goku, and this my home... and you're not welcome here!",
    "And, last but not least.... KAAAAAMEEEEEHAAAAMEEEEEEHAAAAAAA!!!!!",
    "What's ridiculous is the creature that doesn't believe in respect. There are certain things you don't do, certain things that are understood. You don't ever mess with a man's family.",
    "Welcome back Vegeta. I guess it's a good thing I didn't bury you that deep after all.",
    "Your energy level is decreasing with every blow. In fact, you're not even a challenge to me anymore. It wouldn't be fair for me to keep fighting you. I'm satisfied now. Your pride has been torn to shreds. You've challenged and lost to a fighter who is superior to you, and to make it worse...he's just a monkey...right?",
    "Power comes in response to a need, not a desire.",
    "I don't understand why you call Saiyans by such mindless names. The only thing it does it reveal your own fear and ignorance. I guess name calling is your only attack, because you're too weak to challenge me any other way."
  ],
  "vegeta": [
    "Strength is the only thing that matters in this world. Everything else is just a delusion for the weak.",
    "There is only one certainty in life. A strong man stands above and conquers all!",
    "Push through the pain. Giving up hurts more.",
    "Welcome to the end of your life! And I promise it's going to hurt.",
    "Even the mightiest warriors experience fears. What makes them a true warrior is the courage that they possess to overcome their fears.",
    "I do not fear this new challenge. Rather like a true warrior I will rise to meet it.",
    "Never send a boy to do a man's job.",
    "I'll never give in to you circus freaks! Every time I reach a new level of strength, a greater power appears to challenge my authority. It's as if fate is laughing at me with a big stupid grin, just like Kakarot.",
    "Are you ready now to witness a power not seen for thousands of years?",
    "Don't remind me. I'm mad enough to hurt somebody and pounding you just might be the therapy I need.",
    "What's wrong Frieza? Is your brain another one of your weak and under used muscles?",
    "It's over 9,000!"
  ],
  "frieza": [
    "There are three things I refuse to tolerate. Cowardice, bad haircuts, and military insurrection. And it is unfortunate that our friend Vegeta possesses all three of these.",
    "I doubt I need an introduction, but just in case, I am the mighty Frieza and yes, all the horrible stories you've heard are true.",
    "Before you begin your pathetic struggle to survive, I should warn you. Your chance of winning is nonexistent.",
    "Don't look so surprised Vegeta! I'll be right with you, but first I must exterminate the mighty midget.",
    "Vegeta, face it. To fight with me is futile and useless. Just wake up. You're blind and delusional. You keep going on about being a Super Saiyan, but it's just a myth Vegeta. I've never seen one, have you? You're such a chump. Heh heh.",
    "Miserable Saiyan monkey.",
    "Why you insolent tree monkey, I've had enough of this, you're the one who's going to pay. Talk, all you are is a bunch of talk. Allow me to show you something not even what your father saw in his lifetime.",
    "Don't worry. It won't hurt too bad. Really. Death is my specialty.",
    "Yes, because when one revolts, the others are sure to follow. You know, monkey see…monkey do.",
    "The sun is shining, the ocean is a sparkling blue, the mountains can be seen in the background. It's positively perfect. Now all we have to do is decide which one of you gets to die first.",
    "Heh heh heh. That's right. Get it all out. Live boldly…even if it is only for a few more moments.",
    "Don't be glum. You should actually be flattered. I've never had to summon this much of my power to defeat someone. Fifty percent of my maximum. That's all that's required for this."
  ]
}
