{
    "June 8, 2020, Monday": [
        "Last date for undergraduate and graduate students to drop courses without academic prejudice, Intersession",
        "Last day for undergraduate students to drop courses and receive a 25% refund of tuition fees",
        "14-week Spring semester. No tuition fees will be refunded for 14-week Spring semester courses dropped after this date."
    ],
    "June 19, 2020, Friday": [
        "Final date for submission of Master's and Doctoral Theses and Reports for examination, by candidates who expect to receive their degree at the Fall Convocation 2020. Theses and Reports received after this date will be processed as time and resources permit.",
        "Lectures end, Intersession"
    ],
    "June 22, 2020, Monday": [
        "Examinations begin, Intersession",
        "Semester Break begins",
        "14-week Spring semester"
    ],
    "June 24, 2020, Wednesday": [
        "Examinations end, Intersession"
    ],
    "June 25, 2020, Thursday": [
        " Lectures resume,",
        "14-week Spring semester"
    ],
    "June 26,2020, Friday": [
        "Academic year ends for Residents",
        "Sessions end for Medical students (Classes of 2022 and 2023)"
    ],
    "June 29, 2020, Monday": [
        "Final date for departments to submit Recommendation for Award of Degree in order for graduate students to receive a 50% refund of continuance fees, Spring semester",
        "Lectures begin for Summer session"
    ],
    "July 1, 2020, Wednesday": [
        "Memorial Day holiday, no lectures"
    ],
    "July 6, 2020, Monday": [
        "End of Regular Registration Period and last day for undergraduate and graduate students to add courses, Summer session",
        " Last date for undergraduate and graduate students to drop courses without academic prejudice,",
        "14-week Spring semester",
        "Last day for undergraduate students to drop courses and receive a 100% refund of tuition fees, Summer session"
    ],
    "July 9, 2020, Thursday": [
        "Last day for undergraduate students to drop courses and receive a 50% refund of tuition fees, Summer session."
    ],
    "July 13, 2020, Monday": [
        "Last day for undergraduate students to drop courses and receive a 25% refund of tuition fees, Summer session. No tuition fees will be refunded for Summer session courses dropped after this date."
    ],
    "July 15, 2020, Wednesday": [
        "Final date for filing, with the Registrar, applications for Degrees and Diplomas for the Fall Convocation 2020. Applications received after this date will be processed as time and resources permit."
    ],
    "July 20, 2020, Monday": [
        "Final date for Departments to submit Recommendation for Award of Degree in order for graduate students to receive a 25% refund of continuance fees, Spring semester"
    ],
    "July 27, 2020, Monday": [
        "Last date for undergraduate and graduate students to drop courses without academic prejudice, Summer session"
    ],
    "July 31, 2020, Friday": [
        "Sessions end for Medical students (Class of 2021)"
    ],
    "August 7, 2020, Friday": [
        "Lectures end",
        "14-week Spring semester. Lectures will follow the Wednesday schedule on this day only"
    ],
    "August 8, 2020, Saturday": [
        "Lectures end, Summer session. Lectures will follow the Wednesday schedule on this day only."
    ],
    "August 10, 2020, Monday": [
        "Examinations begin,",
        "14-week Spring semester and Summer session",
        "Final date for submission of Work Reports by Co-operative Education students"
    ],
    "August 12, 2020, Wednesday": [
        "Examinations end, Summer session"
    ],
    "August 15, 2020, Saturday": [
        "Examinations end,",
        "14-week Spring semester"
    ],
    "August 21, 2020, Friday": [
        "Spring Work Term ends for Co-operative Education students"
    ]
}